ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	КоличествоДнейОтпуска();
КонецПроцедуры 

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	КоличествоДнейОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	КоличествоДнейОтпуска();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура КоличествоДнейОтпуска() 
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Сотрудник) 
		И ЗначениеЗаполнено(ТекДанные.ДатаНачала) 
		И ЗначениеЗаполнено(ТекДанные.ДатаОкончания) Тогда  
		ТекДанные.КоличествоДней = (ТекДанные.ДатаОкончания - ТекДанные.ДатаНачала) / 86400 + 1;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура АнализГрафика(Команда)
	Адрес = АнализГрафикаНаСервере();       
	Если ЗначениеЗаполнено(Объект.Год) Тогда   
			
		СтруктураПараметры = Новый Структура("АдресХранилища, Год", Адрес, Объект.Год); 
		 
	Иначе ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран год отпусков");   
		
	КонецЕсли;
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", СтруктураПараметры);
КонецПроцедуры


&НаСервере
Функция АнализГрафикаНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
	
КонецФункции  

#КонецОбласти
